tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/middleware autotune/r_aid_core.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2018 Renesas Electronics Corporation. All rights reserved.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_aid_core.c
 * Version      : 1.0
 * Description  : This module solves all the world's problems
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 15.01.2007 1.00     First Release
 **********************************************************************************************************************/
/*******************************************************************************************************************//**
 * @ingroup Tuner_Interface
 * @defgroup CORE CORE module
 * @brief CORE module handles calibrations, current/speed control and signals. Also launch events for upper layer
 * @{
 **********************************************************************************************************************/

/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
#include <math.h>
#include <stdint.h>
//#include <machine.h>
#include "r_aid_core.h"
#include "r_aid_driver_if.h"
#include "r_aid_volterr_comp.h"
#include "r_aid_pi_control.h"
#include "r_aid_filter.h"
#include "r_aid_transform.h"

/***********************************************************************************************************************
 Macro definitions
 **********************************************************************************************************************/
#ifndef AID_PRV_FILE_CODE
    #define AID_PRV_FILE_CODE (107)
#endif
#define AID_CORE_PRV_OL2CL_METHOD                (1)
#define AID_CORE_PRV_INV_CURRENT_LIMIT           (5.0f)

/***********************************************************************************************************************
 Typedef definitions
 **********************************************************************************************************************/
typedef struct {
    uint32_t u4_warn_core_flags;
} st_aid_warn_t;

/***********************************************************************************************************************
 Exported global variables (to be accessed by other files)
 **********************************************************************************************************************/
uint16_t  aid_u2_ctrl_level;
e_aid_rotor_angle_mode_t aid_s4_rotor_angle_mode;
uint16_t  aid_u2_error_status;
uint16_t  aid_u2_run_mode;
/* Inverter properties */
float aid_f4_current_lsb;
float aid_f4_pwm_duty_lsb;

/* Measurement parameters */
float  aid_f4_r_dc;
float  aid_f4_v_err;
float  aid_f4_r;
float  aid_f4_ld;
float  aid_f4_lq;
float  aid_f4_ke;
float  aid_f4_j;
float  aid_f4_d;

/* Input */
float aid_f4_rated_current;
float aid_f4_rated_power;
float aid_f4_pole_pairs;
float aid_f4_r_max;
float aid_f4_r_min;
float aid_f4_ld_min;
float aid_f4_lq_min;

/* Motor driver */
float aid_f4_duty_available;
float aid_f4_vmag_max;                     /* Maximum magnitude of available voltage */
float aid_f4_imag_max;
float aid_f4_ia_ad;
float aid_f4_ib_ad;
float aid_f4_ic_ad;
float aid_f4_offset_ia;
float aid_f4_offset_ib;
float aid_f4_pre_offset_ia;
float aid_f4_pre_offset_ib;
float aid_f4_offset_lpf_k;
uint16_t  aid_u2_cnt_adjust;
float aid_f4_offset_calc_time;
float aid_f4_vdc_ad;
float aid_f4_id_ad;
float aid_f4_iq_ad;
float aid_f4_angle_rad;
float aid_f4_lim_iq;
float aid_f4_overcurrent_limit_hw;
float aid_f4_overcurrent_limit;
float aid_f4_overvoltage_limit;
float aid_f4_undervoltage_limit;
float aid_f4_id_ref;
float aid_f4_iq_ref;
float aid_f4_e;
float aid_f4_e_lpf;
float aid_f4_ref_id;
float aid_f4_ref_speed_rad;
float aid_f4_limit_speed_change;            /* Limit of speed change rate [(rad/s)/ms] */
float aid_f4_speed_rad;
float aid_f4_speed_lpf_rad;
st_aid_1st_order_lpf_t aid_st_speed_lpf;
float aid_f4_speed_lpf_omega_hz;
float aid_f4_omega_current;
float aid_f4_zeta_current;
float aid_f4_kp_id;
float aid_f4_ki_id;
float aid_f4_kp_iq;
float aid_f4_ki_iq;
float aid_f4_omega_e_obs;
float aid_f4_zeta_e_obs;
float aid_f4_k_e_obs_d_1;
float aid_f4_k_e_obs_d_2;
float aid_f4_k_e_obs_q_1;
float aid_f4_k_e_obs_q_2;
float aid_f4_kp_speed;
float aid_f4_ki_speed;
float aid_f4_id_down_speed_rad;
float aid_f4_id_up_speed_rad;
float aid_f4_id_up_step;
float aid_f4_id_down_step;
float aid_f4_pre_id_ad;
float aid_f4_pre_id_est;
float aid_f4_pre_dd;
float aid_f4_id_est;
float aid_f4_dd;
float aid_f4_ref_speed_rad_ctrl;
float aid_f4_ed;
float aid_f4_pre_iq_ad;
float aid_f4_pre_iq_est;
float aid_f4_pre_dq;
float aid_f4_iq_est;
float aid_f4_iq_est_limit;
float aid_f4_dq;
float aid_f4_dq_limit;
float aid_f4_eq;
float aid_f4_phase_error;
float aid_f4_va_ref;
float aid_f4_vb_ref;
float aid_f4_vc_ref;
float aid_f4_va_ref_pwm;
float aid_f4_vb_ref_pwm;
float aid_f4_vc_ref_pwm;
float aid_f4_va_ref_comp;
float aid_f4_vb_ref_comp;
float aid_f4_vc_ref_comp;
float aid_f4_vphase_limit;
float aid_f4_moda;
float aid_f4_modb;
float aid_f4_1ms_speed_rad;
uint16_t  aid_u2_ctrl_conf;
uint8_t aid_u1_flag_down_to_ol;
uint8_t aid_u1_flag_iq_ref;
uint8_t aid_u1_flag_id_ref;
uint8_t aid_u1_flag_speed_ref;
float aid_f4_iq_down_step;
float aid_f4_ol_iq_down_step;
float aid_f4_kp_est_speed;
float aid_f4_ki_est_speed;
float aid_f4_i_est_speed;
float aid_f4_ia_ref;
float aid_f4_ib_ref;
float aid_f4_ic_ref;
float aid_f4_vcomp_array[3];
float aid_f4_vcomp_i_array[3];
float aid_f4_temp_cos;
float aid_f4_temp_sin;
st_aid_pi_ctrl_t st_aid_vd;
st_aid_pi_ctrl_t st_aid_vq;
st_aid_pi_ctrl_t st_aid_speed;
st_aid_volterr_comp_t st_aid_volt_comp_p;
float  aid_f4_phase_error_lpf;
float  aid_f4_phase_error_hpf;
float  aid_f4_bemf_a_lpf;
float  aid_f4_bemf_a_lpf_prev;
float  aid_f4_torque_current;

