tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/middleware autotune/r_aid_core.c
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
    float aid_f4_offset_ic;
    float aid_f4_pre_offset_ic;
    float aid_f4_modc;
#endif

/* Common */
uint32_t  aid_u4_sample_cnt;
uint16_t  aid_u2_1ms_cnt;
uint16_t  aid_u2_sum_cnt;
float aid_f4_f_ref;
float aid_f4_vd_ref;
float aid_f4_vq_ref;
aid_rotor_angle_t aid_st_rotor_angle;

float aid_f4_pwm_period_ms;
float aid_f4_ctrl_period_ms;
float aid_f4_spd_ctrl_period_ms;
float aid_f4_ctrl_freq_hz;
float aid_f4_spd_ctrl_freq_hz;

uint32_t dbg_u4_line;
uint32_t dbg_u4_file;
float dbg_f4_ld_bemf_observer;

float kp_id_final, ki_id_final, kp_iq_final, ki_iq_final;

/* Warning message */
st_aid_warn_t aid_st_warn;

/* Inverter info */
st_aid_inv_info_t aid_st_inv_info;


/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
static void core_dummy_delegate(void);

core_delegate_t gs_before_current_ctrl = core_dummy_delegate;
core_delegate_t gs_after_pwm_output    = core_dummy_delegate;

/*******************************************************************************************************************//**
 * @brief Dummy function for avoiding null function pointer
 **********************************************************************************************************************/
static void core_dummy_delegate(void)
{
    /* Do nothing */
    __asm __volatile("nop\n");
} /* End of function core_dummy_delegate */

/*******************************************************************************************************************//**
 * @brief  Generates speed command
 * @return Speed command value [rad/s]
 **********************************************************************************************************************/
static float core_generate_speed_ref(void)
{
    float f4_temp0;
    float f4_temp1;
    float f4_speed_rad_ref_buff=0;

    switch (aid_u1_flag_speed_ref)
    {
        case AID_SPEED_ZERO_CONST:
        {
            //f4_speed_rad_ref_buff = 0.0f;
            f4_speed_rad_ref_buff = aid_f4_ref_speed_rad_ctrl;
            if (AID_ID_CONST == aid_u1_flag_id_ref)
            {
                aid_u1_flag_speed_ref = AID_SPEED_CHANGE;
            }
        }
        break;

        case AID_SPEED_CHANGE:
        {
            f4_temp0 = aid_f4_ref_speed_rad - aid_f4_ref_speed_rad_ctrl;
            f4_temp1 = fminf(aid_f4_limit_speed_change * aid_f4_spd_ctrl_period_ms, fabsf(f4_temp0));
            f4_speed_rad_ref_buff = aid_f4_ref_speed_rad_ctrl + copysignf(f4_temp1, f4_temp0);
        }
        break;

        default:
        {
            AID_ASSERT_FAIL();
        }
        break;
    }

    /* return speed reference */
    return(f4_speed_rad_ref_buff);
} /* End of function core_generate_speed_ref */

/*******************************************************************************************************************//**
 * @brief Generate Iq reference
 * @return Iq reference [A]
 **********************************************************************************************************************/
static float core_generate_iq_ref(void)
{
    float f4_temp0;
    float f4_iq_ref_buff=0;

    if (AID_FLG_SET == aid_u1_flag_down_to_ol)
    {
        aid_u1_flag_iq_ref = AID_IQ_DOWN;
        aid_s4_rotor_angle_mode = AID_ROTOR_ANGLE_MODE_OPENLOOP;
        aid_f4_iq_down_step = aid_f4_ol_iq_down_step * aid_f4_iq_ref;
    }

    switch (aid_u1_flag_iq_ref)
    {
        case AID_IQ_ZERO_CONST:
        {
            aid_s4_rotor_angle_mode = AID_ROTOR_ANGLE_MODE_OPENLOOP;
            f4_iq_ref_buff = 0.0f;
            f4_temp0 = fabsf(aid_f4_1ms_speed_rad);
#if (AID_CORE_PRV_OL2CL_METHOD == 1)
            /* If the speed is sufficient to estimate phase error, refresh the maximum value of torque current */
            if(f4_temp0 > aid_f4_id_down_speed_rad * 0.75f)
            {
                /* Simplified, Iq is always zero at this state */
                float torque_current_temp = sinf(aid_f4_phase_error_lpf) * aid_f4_id_ref;

                /* use maximum value to ensure the estimated torque current value is high enough
                 *  for performing OL to CL transition */
                aid_f4_torque_current = (torque_current_temp > aid_f4_torque_current) ?
                                        (torque_current_temp) : (aid_f4_torque_current);
            }
#endif
            if (f4_temp0 >= aid_f4_id_down_speed_rad)
            {
#if (AID_CORE_PRV_OL2CL_METHOD == 1)
                aid_u1_flag_iq_ref = AID_IQ_CL_TRANS;
#elif (AID_CORE_PRV_OL2CL_METHOD == 0)
                aid_u1_flag_iq_ref = AID_IQ_SPEED_PI_OUTPUT;
                aid_s4_rotor_angle_mode = AID_ROTOR_ANGLE_MODE_CLOSEDLOOP;
                aid_f4_i_est_speed = aid_f4_ref_speed_rad_ctrl;
#endif
            }
        }
        break;

        case AID_IQ_CL_TRANS:
        {
            /* Increase Iq to eliminate the phase error before transit to the closed-loop FOC operation */
            f4_iq_ref_buff = aid_f4_iq_ref;
            f4_iq_ref_buff += (aid_f4_torque_current * (aid_f4_spd_ctrl_period_ms / g_f4_aid_id_up_time) *
                              (aid_f4_phase_error_hpf >= (-g_f4_aid_ol2cl_inciq_phaseerr_dec_th))) * g_f4_aid_ol2cl_crnt_inc_mult;

            /* Limit Iq reference */
            f4_iq_ref_buff = R_AID_LimitfAbs(f4_iq_ref_buff, aid_f4_lim_iq);
            if (f4_iq_ref_buff < 0.0f)
            {
                f4_iq_ref_buff = 0.0f;
            }

            if ((AID_ID_ZERO_CONST == aid_u1_flag_id_ref) ||              /* Id became zero, the ol2cl phase ends */
                (aid_f4_id_ref <= aid_f4_torque_current) ||               /* Leave enough Id to prevent motor stall */
                (aid_f4_phase_error_lpf < 0.0f) ||                        /* The phase error has been eliminated */
                (aid_f4_phase_error_hpf < (-g_f4_aid_ol2cl_phaseerr_max_dec))) /* The phase error decreases too fast */
            {
                /* Set the current speed to the PLL integrator to ensure smooth transition */
                aid_f4_ref_speed_rad_ctrl = aid_f4_speed_lpf_rad;
                aid_f4_i_est_speed = aid_f4_ref_speed_rad_ctrl;

                /* Set the current Iq to the speed PI integrator to ensure smooth transition */
                st_aid_speed.f4_refi = f4_iq_ref_buff;

