tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/middleware autotune/r_aid_core.c
                /* Enable normal FOC operation */
                aid_u1_flag_iq_ref = AID_IQ_SPEED_PI_OUTPUT;
                aid_s4_rotor_angle_mode = AID_ROTOR_ANGLE_MODE_CLOSEDLOOP;
            }
        }
        break;

        case AID_IQ_SPEED_PI_OUTPUT:
        {
            /*** speed PI control ***/
            f4_iq_ref_buff = aid_pi_ctrl(&st_aid_speed, aid_f4_ref_speed_rad_ctrl - aid_f4_1ms_speed_rad);

            /*** iq reference limit ***/
            f4_iq_ref_buff = R_AID_LimitfAbs(f4_iq_ref_buff, aid_f4_lim_iq);
        }
        break;

        case AID_IQ_DOWN:
        {
            f4_iq_ref_buff = aid_f4_iq_ref - aid_f4_iq_down_step;
            f4_temp0 = aid_f4_iq_down_step * f4_iq_ref_buff;                 /* check sign */
            if (f4_temp0 <= 0)
            {
                f4_iq_ref_buff = 0.0f;
                aid_u1_flag_iq_ref = AID_IQ_ZERO_CONST;
            }
        }
        break;

        default:
        {
            /* Do Nothing */
            break;
        }
    }

    /* return iq reference */
    return(f4_iq_ref_buff);
} /* End of function core_generate_iq_ref */

/*******************************************************************************************************************//**
 * @brief  Generate Id reference
 * @return Id reference [A]
 **********************************************************************************************************************/
static float core_generate_id_ref(void)
{
    float f4_temp0;
    float f4_id_ref_buff=0;

    if (AID_FLG_SET == aid_u1_flag_down_to_ol)
    {
        aid_u1_flag_id_ref = AID_ID_UP;
    }
    switch (aid_u1_flag_id_ref)
    {
        case AID_ID_UP:
        {
            f4_id_ref_buff = aid_f4_id_ref + aid_f4_id_up_step;
            if (f4_id_ref_buff >= aid_f4_ref_id)
            {
                f4_id_ref_buff = aid_f4_ref_id;
                aid_u1_flag_id_ref = AID_ID_CONST;
            }
        }
        break;

        case AID_ID_CONST:
        {
            f4_id_ref_buff = aid_f4_id_ref;
            if ((uint8_t)aid_f4_ref_id != (uint8_t)f4_id_ref_buff)
            {
                f4_id_ref_buff = aid_f4_ref_id;
            }

            f4_temp0 = fabsf(aid_f4_ref_speed_rad_ctrl);
            if (f4_temp0 >= aid_f4_id_down_speed_rad)
            {
                aid_u1_flag_id_ref = AID_ID_DOWN;
            }
        }
        break;

        case AID_ID_DOWN:
        {
            f4_id_ref_buff = aid_f4_id_ref - aid_f4_id_down_step;
            if (f4_id_ref_buff < 0.0f)
            {
                f4_id_ref_buff = 0.0f;
                aid_u1_flag_id_ref = AID_ID_ZERO_CONST;
            }
        }
        break;

        case AID_ID_ZERO_CONST:
        {
            f4_id_ref_buff = 0.0f;
        }
        break;

        default:
        {
            AID_ASSERT_FAIL();
        }
        break;
    }

    /* return id reference */
    return(f4_id_ref_buff);
} /* End of function core_generate_id_ref */

/******************************************************************************
* Function Name : core_check_over_current_error
* Description   : Over current error check
* Arguments     : Iu, Iv, Iw, over current limit value
* Return Value  : error status
******************************************************************************/
static void core_check_over_current_error(float f4_iu, float f4_iv, float f4_iw, float f4_overcurrent_limit)
{
    float f4_temp0;

    f4_temp0 = fabsf(f4_iu);
    if (f4_temp0 > f4_overcurrent_limit)
    {
        aid_core_throw_error(AID_ERROR_OVER_CURRENT_SW);
    }

    f4_temp0 = fabsf(f4_iv);
    if (f4_temp0 > f4_overcurrent_limit)
    {
        aid_core_throw_error(AID_ERROR_OVER_CURRENT_SW);
    }

    f4_temp0 = fabsf(f4_iw);
    if (f4_temp0 > f4_overcurrent_limit)
    {
        aid_core_throw_error(AID_ERROR_OVER_CURRENT_SW);
    }
} /* End of function core_check_over_current_error */

/******************************************************************************
* Function Name : core_check_over_voltage_error
* Description   : Over voltage error check
* Arguments     : Vdc value, over voltage limit value
* Return Value  : error status
******************************************************************************/
static void core_check_over_voltage_error(float f4_vdc, float f4_overvoltage_limit)
{
    if (f4_vdc > f4_overvoltage_limit)
    {
        aid_core_throw_error(AID_ERROR_OVER_VOLTAGE);              /* over voltage error */
    }
} /* End of function core_check_over_voltage_error */

/******************************************************************************
* Function Name : core_check_under_voltage_error
* Description   : Under voltage error check
* Arguments     : Vdc value, under voltage limit value
* Return Value  : error status
******************************************************************************/
static void core_check_under_voltage_error(float f4_vdc, float f4_undervoltage_limit)
{
    if (f4_vdc < f4_undervoltage_limit)
    {
        aid_core_throw_error(AID_ERROR_UNDER_VOLTAGE);             /* under voltage error */
    }
} /* End of function core_check_under_voltage_error */

/*******************************************************************************************************************//**
 * Initializes Ke (BEMF constant) identification module
 **********************************************************************************************************************/
static void core_angle_speed_est(void)
{
    float f4_temp0;
    float f4_temp1;
    static float pll_rampup;

    if ((AID_ROTOR_ANGLE_MODE_CLOSEDLOOP) == aid_s4_rotor_angle_mode)
    {
        /* Estimate angle and speed with PLL */
        pll_rampup = (pll_rampup > 1.0f) ?  1.0f : (pll_rampup + 0.01f);
        f4_temp0 = (-aid_f4_phase_error) * pll_rampup;

        /* Speed calculation, speed is estimated by PLL */
        f4_temp1 = f4_temp0 * aid_f4_kp_est_speed;
        aid_f4_i_est_speed += (f4_temp0 * aid_f4_ki_est_speed);
        aid_f4_speed_rad = f4_temp1 + aid_f4_i_est_speed;
    }
    else if ((AID_ROTOR_ANGLE_MODE_OPENLOOP) == aid_s4_rotor_angle_mode)
    {
        /* speed setting */
        aid_f4_speed_rad = aid_f4_ref_speed_rad_ctrl;
        pll_rampup = 1.00f;
    }
    else
    {
        /* Do nothing */
        __asm __volatile("nop\n");
    }
    aid_f4_speed_lpf_rad = R_AID_FirstOrderLpff(&aid_st_speed_lpf, aid_f4_speed_rad);
    aid_f4_angle_rad += (aid_f4_speed_rad * aid_f4_ctrl_period_ms * 0.001f);

