tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/middleware autotune/r_aid_core.c
    f4_temp0 = fabsf(aid_f4_angle_rad);
    if (f4_temp0 > AID_TWOPI)
    {
        f4_temp0 = f4_temp0 - AID_TWOPI;
        aid_f4_angle_rad = copysignf(f4_temp0, aid_f4_angle_rad);
    }
} /* End of function core_angle_speed_est */

/*******************************************************************************************************************//**
 * Estimates BEMF vector, calculates amplitude and angle of BEMF
 **********************************************************************************************************************/
static void core_bemf_observer(void)
{
    float f4_temp0;
    float f4_temp1;
    float f4_temp2;
    float f4_temp3;
    float f4_ld;

#if (AID_LD_USE_LOOKUP_TABLE == 1)
    f4_ld = aid_lookuptab_intpltonly(&st_ld_table, aid_f4_id_ad);
#else
    f4_ld = aid_f4_ld;
#endif
    dbg_f4_ld_bemf_observer = f4_ld;

    /*************** d-axis ***************/
    aid_f4_pre_id_est = aid_f4_id_est;
    f4_temp0 = (aid_f4_pre_id_ad - aid_f4_pre_id_est) * f4_ld * aid_f4_k_e_obs_d_1;
    f4_temp1 = aid_f4_pre_id_est * aid_f4_r;
    f4_temp2 = (f4_temp0 - f4_temp1) + aid_f4_vd_ref + aid_f4_pre_dd;
    f4_temp3 = f4_temp2 / f4_ld;
    aid_f4_id_est = aid_f4_pre_id_est + (aid_f4_ctrl_period_ms * 0.001f * f4_temp3);

    aid_f4_pre_dd = aid_f4_dd;
    f4_temp0 = aid_f4_id_ad - aid_f4_id_est;
    f4_temp1 = f4_temp0 * aid_f4_k_e_obs_d_2;
    aid_f4_dd = aid_f4_pre_dd + ((aid_f4_ctrl_period_ms * 0.001f) * f4_temp1);

    f4_temp0 = aid_f4_speed_rad * aid_f4_lq * aid_f4_iq_ad;
    aid_f4_ed = (- aid_f4_dd) + f4_temp0;


    /*************** q-axis ***************/
    aid_f4_pre_iq_est = aid_f4_iq_est;
    f4_temp0 = (aid_f4_pre_iq_ad - aid_f4_pre_iq_est) * aid_f4_lq * aid_f4_k_e_obs_q_1;
    f4_temp1 = aid_f4_pre_iq_est * aid_f4_r;
    f4_temp2 = (f4_temp0 + aid_f4_vq_ref + aid_f4_pre_dq) - f4_temp1;
    f4_temp3 = f4_temp2 / aid_f4_lq;
    aid_f4_iq_est = aid_f4_pre_iq_est + (aid_f4_ctrl_period_ms * 0.001f * f4_temp3);

    aid_f4_pre_dq = aid_f4_dq;
    f4_temp0 = aid_f4_iq_ad - aid_f4_iq_est;
    f4_temp1 = f4_temp0 * aid_f4_k_e_obs_q_2;
    aid_f4_dq = aid_f4_pre_dq + (aid_f4_ctrl_period_ms * 0.001f * f4_temp1);

    f4_temp0 = aid_f4_speed_rad * f4_ld * aid_f4_id_ad;
    aid_f4_eq = (- aid_f4_dq) - f4_temp0;

    /* save current */
    aid_f4_pre_id_ad = aid_f4_id_ad;
    aid_f4_pre_iq_ad = aid_f4_iq_ad;

    /* BEMF estimate */
    aid_f4_e = sqrtf((aid_f4_ed * aid_f4_ed) + (aid_f4_eq * aid_f4_eq));
    if (aid_f4_eq < 0)
    {
        aid_f4_e = -aid_f4_e;
    }

    /* delta angle estimate */
    aid_f4_phase_error = atanf(aid_f4_ed / aid_f4_eq);
} /* End of function core_bemf_observer */

/*******************************************************************************************************************//**
 * @brief  Measures current offset
 * @retval 0 Not completed yet
 * @retval 1 Completed
 **********************************************************************************************************************/
static uint32_t core_offset_measure(void)
{
    /* current offset detection */
    aid_f4_offset_ia = R_AID_Lpff(aid_f4_ia_ad, aid_f4_pre_offset_ia, aid_f4_offset_lpf_k);
    aid_f4_pre_offset_ia = aid_f4_offset_ia;
    aid_f4_offset_ib = R_AID_Lpff(aid_f4_ib_ad, aid_f4_pre_offset_ib, aid_f4_offset_lpf_k);
    aid_f4_pre_offset_ib = aid_f4_offset_ib;
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
    aid_f4_offset_ic = R_AID_Lpff(aid_f4_ic_ad, aid_f4_pre_offset_ic, aid_f4_offset_lpf_k);
    aid_f4_pre_offset_ic = aid_f4_offset_ic;
#endif
    aid_u2_cnt_adjust++;
    return (aid_u2_cnt_adjust >= aid_f4_offset_calc_time);
} /* End of function core_offset_measure */

/*******************************************************************************************************************//**
 * @brief     Set-up voltage limiters with given phase voltage limit
 * @param[in] f4_voltage_limit  The phase voltage limit
 **********************************************************************************************************************/
static void core_set_voltage_limit(float f4_voltage_limit)
{
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
    aid_f4_vmag_max = f4_voltage_limit * (AID_SQRT_3 / AID_SQRT_2);
#else
    aid_f4_vmag_max = f4_voltage_limit;
#endif

    aid_f4_vphase_limit = f4_voltage_limit;

    /* Set integral limit for current regulators */
    st_aid_vd.f4_ilimit = f4_voltage_limit;
    st_aid_vq.f4_ilimit = f4_voltage_limit;
} /* End of function core_set_voltage_limit */

/*******************************************************************************************************************//**
 * @brief Restart motor drive without change configurations and controller gains
 * @pre   aid_u2_run_mode is under AID_RUNMODE_INIT condition
 **********************************************************************************************************************/
static void core_restart_drive(void)
{
    if (aid_u2_run_mode == AID_RUNMODE_INIT)
    {
        /* Common */
        aid_u4_sample_cnt = 0;
        aid_u2_1ms_cnt    = 0;
        aid_u2_sum_cnt    = 0;

        /* Reset modes */
        aid_s4_rotor_angle_mode = AID_ROTOR_ANGLE_MODE_OPENLOOP;
        aid_core_set_ctrl_level(AID_CTRL_LEVEL_0);
        aid_u2_error_status    = AID_ERROR_NONE;
        aid_u1_flag_id_ref     = AID_ID_UP;
        aid_u1_flag_iq_ref     = AID_IQ_ZERO_CONST;
        aid_u1_flag_speed_ref  = AID_SPEED_ZERO_CONST;
        aid_u1_flag_down_to_ol = 0;
        aid_u2_ctrl_conf = 0;

        /* Motor driver */
        aid_f4_ia_ad  = 0.0f;
        aid_f4_ib_ad  = 0.0f;
        aid_f4_vd_ref = 0.0f;
        aid_f4_vq_ref = 0.0f;
        aid_f4_ia_ref = 0.0f;
        aid_f4_ib_ref = 0.0f;
        aid_f4_id_ref = 0.0f;
        aid_f4_iq_ref = 0.0f;
        aid_f4_id_ad  = 0.0f;
        aid_f4_iq_ad  = 0.0f;
        aid_f4_vdc_ad = 0.0f;

        aid_f4_imag_max = 1.0f;         /* This value will be overrided when setting rated current */

        /* Reset offset calibration */
        aid_f4_offset_ia = 0.0f;
        aid_f4_offset_ib = 0.0f;
        aid_f4_pre_offset_ia = 0.0f;
        aid_f4_pre_offset_ib = 0.0f;
        aid_u2_cnt_adjust = 0;

        /* Reset PLL */
        aid_f4_phase_error = 0.0f;
        aid_f4_speed_rad = 0.0f;
        aid_f4_angle_rad = 0.0f;
        aid_f4_i_est_speed = 0.0f;
        aid_f4_temp_cos = 1.0f;     /* Cos(0) */
        aid_f4_temp_sin = 0.0f;

