tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/middleware autotune/r_aid_core.c
        /* Reset current control */
        aid_f4_kp_id = 0.0f;
        aid_f4_ki_id = 0.0f;
        aid_f4_kp_iq = 0.0f;
        aid_f4_ki_iq = 0.0f;
        st_aid_vd.f4_refi = 0.0f;
        st_aid_vq.f4_refi = 0.0f;

        /* Reset BEMF observer */
        aid_f4_pre_id_ad = 0.0f;
        aid_f4_pre_id_est = 0.0f;
        aid_f4_pre_dd = 0.0f;
        aid_f4_id_est = 0.0f;
        aid_f4_dd = 0.0f;
        aid_f4_pre_iq_ad = 0.0f;
        aid_f4_pre_iq_est = 0.0f;
        aid_f4_pre_dq = 0.0f;
        aid_f4_iq_est = 0.0f;
        aid_f4_dq = 0.0f;
        aid_f4_ed = 0.0f;
        aid_f4_eq = 0.0f;
        aid_f4_e = 0.0f;
        aid_f4_e_lpf = 0.0f;

        /* Reset speed control, speed change rate limiter */
        aid_f4_ref_speed_rad_ctrl = 0.0f;
        aid_f4_ref_speed_rad = 0.0f;
        st_aid_speed.f4_refi = 0.0f;

        /* Reset start-up sequence parameters */
        aid_f4_id_down_speed_rad = 0.0f;
        aid_f4_id_up_speed_rad = 0.0f;
        aid_f4_id_up_step = 0.0f;
        aid_f4_id_down_step = 0.0f;
        aid_f4_ref_id = 0.0f;
        aid_f4_iq_down_step = 0.0f;

        /* Resets modulation */
        aid_f4_va_ref = 0.0f;
        aid_f4_vb_ref = 0.0f;
        aid_f4_va_ref_comp = 0.0f;
        aid_f4_vb_ref_comp = 0.0f;
        aid_f4_vphase_limit = 0.0f;
        aid_f4_moda = 0.0f;
        aid_f4_modb = 0.0f;

        /* Reset voltage error compensation */
        aid_f4_vcomp_array[0] = 0.0f;
        aid_f4_vcomp_array[1] = 0.0f;
        aid_f4_vcomp_i_array[0] = 0.0f;
        aid_f4_vcomp_i_array[1] = 0.0f;

        /* Reset speed LPF */
        aid_f4_speed_lpf_rad = 0.0f;
        aid_f4_1ms_speed_rad = 0.0f;
        aid_f4_speed_lpf_omega_hz = 125.0f;
        R_AID_FirstOrderLpffReset(&aid_st_speed_lpf);

        /* Reset flags */
        aid_st_warn.u4_warn_core_flags = 0;

        aid_hal_pwm_enable();
    }
    else
    {
        AID_ASSERT_FAIL();
    }
} /* End of function core_restart_drive */

/*******************************************************************************************************************//**
 * @brief     Performs multiple filter process on estimated signals
 *
 * @param[in] phase_error_rad  The phase error in [rad]
 * @param[in] est_bemf         The estimated magnitude of BEMF [V]
 **********************************************************************************************************************/
static void core_estimator_filter(float phase_error_rad, float est_bemf)
{
    float f4_phase_error_lpf_pre;
    float f4_lpf_num = ((AID_TWOPI * g_f4_aid_phaseerr_lpf_band_hz) * (aid_f4_ctrl_period_ms * 0.001f));
    float f4_lpf_den = 1.0f - ((AID_TWOPI * g_f4_aid_phaseerr_lpf_band_hz) * (aid_f4_ctrl_period_ms * 0.001f));

    aid_f4_bemf_a_lpf = (aid_f4_bemf_a_lpf * f4_lpf_den) + (est_bemf * f4_lpf_num);
    f4_phase_error_lpf_pre = aid_f4_phase_error_lpf;
    aid_f4_phase_error_lpf = (aid_f4_phase_error_lpf * f4_lpf_den) + (phase_error_rad * f4_lpf_num);
    aid_f4_phase_error_hpf = (aid_f4_phase_error_hpf * f4_lpf_den) +
            ((aid_f4_phase_error_lpf - f4_phase_error_lpf_pre) * (aid_f4_ctrl_freq_hz * f4_lpf_num));

    aid_f4_e_lpf = aid_f4_e_lpf * f4_lpf_den + aid_f4_e * f4_lpf_num;
} /* End of function core_estimator_filter */

/*******************************************************************************************************************//**
 * Record debug data when assert failure happened
 *
 * @param[in] line  The line where the assertion failure happened
 * @param[in] file  The file code where the assertion failure happened
 **********************************************************************************************************************/
void aid_core_assert_fail(uint32_t line, uint32_t file)
{
    aid_core_throw_error(AID_ERROR_ASSERT_FAIL);
    dbg_u4_line = line;
    dbg_u4_file = file;
} /* End of function aid_core_assert_fail */

/*******************************************************************************************************************//**
 * @brief     Throw an error with the given error code and stop PWM output
 * @param[in] u2_error_code  The error code of the error
 **********************************************************************************************************************/
void aid_core_throw_error(uint16_t u2_error_code)
{
    aid_u2_error_status = u2_error_code;
    aid_core_stop();
    aid_core_on_error(u2_error_code);
} /* End of function aid_core_throw_error */

/*******************************************************************************************************************//**
 * Configure start-up sequence
 *
 * @param[in] f4_ref_id           The Id[A] injected in open-loop mode
 * @param[in] f4_ol2cl_speed_rad  The open-loop to closed-loop switching threshold speed in [rad/s]
 * @param[in] f4_cl2ol_speed_rad  The closed-loop to open-loop switching threshold speed in [rad/s]
 **********************************************************************************************************************/
void aid_core_set_startup_params(float f4_ref_id, float f4_ol2cl_speed_rad, float f4_cl2ol_speed_rad)
{
    AID_ASSERT(f4_ref_id >= 0.0f);
    AID_ASSERT(f4_cl2ol_speed_rad >= 0.0f);
    AID_ASSERT(f4_ol2cl_speed_rad >= f4_cl2ol_speed_rad);

    aid_f4_ref_id = f4_ref_id;
    aid_f4_id_down_speed_rad = f4_ol2cl_speed_rad;
    aid_f4_id_up_speed_rad = f4_cl2ol_speed_rad;
    aid_f4_id_up_step = aid_f4_ref_id / g_f4_aid_id_up_time * aid_f4_spd_ctrl_period_ms;
    aid_f4_id_down_step = aid_f4_ref_id / g_f4_aid_id_down_time * aid_f4_spd_ctrl_period_ms;
} /* End of function aid_core_set_startup_params */

/*******************************************************************************************************************//**
 * Configure speed pi with given gains
 *
 * @param f4_kp    - The proportional gain
 * @param f4_kidt  - The integral gain
 **********************************************************************************************************************/
void aid_core_set_speed_pi(float f4_kp, float f4_kidt)
{
    AID_ASSERT(f4_kp    >= 0.0f);
    AID_ASSERT(f4_kidt  >= 0.0f);

