tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/middleware autotune/r_aid_core.c
    aid_f4_kp_speed = f4_kp;
    aid_f4_ki_speed = f4_kidt;
    st_aid_speed.f4_kp = f4_kp;
    st_aid_speed.f4_ki = f4_kidt;
} /* End of function aid_core_set_speed_pi */

/*******************************************************************************************************************//**
 * @brief     Configure rated current, this will also change the current limits and the over-current threshold
 * @param[in] f4_rated_current  The value [A] to be set as the rated current
 **********************************************************************************************************************/
void aid_core_set_rated_current(float f4_rated_current)
{
    AID_ASSERT(f4_rated_current > 0.0f);

#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
    aid_f4_imag_max = f4_rated_current * AID_SQRT_3;
    aid_f4_lim_iq = aid_f4_imag_max;
    st_aid_speed.f4_ilimit   = aid_f4_lim_iq;

    /* The same phase current, just convert [Arms] to [A] by multiply sqrt(2), g_f4_aid_overcurrent_limit_mult is for
     * adding some margin, so it should be larger than 1.0 */
    aid_f4_overcurrent_limit = f4_rated_current * AID_SQRT_2 * g_f4_aid_overcurrent_limit_mult;
#else
    /* Set current limits, the rated current of steppers represents maximum peak current */
    aid_f4_imag_max          = f4_rated_current;
    aid_f4_lim_iq            = aid_f4_imag_max;
    st_aid_speed.f4_ilimit   = aid_f4_lim_iq;
    aid_f4_overcurrent_limit = aid_f4_imag_max * g_f4_aid_overcurrent_limit_mult;
#endif
    if (aid_f4_overcurrent_limit > aid_f4_overcurrent_limit_hw)
    {
        aid_f4_overcurrent_limit = aid_f4_overcurrent_limit_hw;
    }
} /* End of function aid_core_set_rated_current */

/*******************************************************************************************************************//**
 * @brief     Configures the voltage error compensation module with the given lookup table
 *
 * @param[in] f4_current_tab  The pointer to the current column array of the lookup table
 * @param[in] f4_voltage_tab  The pointer to the voltage column array of the lookup table
 * @param[in] f4_vdc_ref      The reference DC bus voltage which is the measurement condition of the given table
 **********************************************************************************************************************/
void aid_core_set_volterr_table(const float *f4_current_tab, const float *f4_voltage_tab, float f4_vdc_ref)
{
    AID_ASSERT(NULL != f4_current_tab);
    AID_ASSERT(NULL != f4_voltage_tab);
    AID_ASSERT(f4_vdc_ref > 0.0f);

    aid_volterr_comp_set_table(&st_aid_volt_comp_p, f4_current_tab, f4_voltage_tab, f4_vdc_ref);
} /* End of function aid_core_set_volterr_table */

void aid_core_clear_error(void)
{
    aid_u2_error_status = AID_ERROR_NONE;
} /* End of function aid_core_clear_error */

/*******************************************************************************************************************//**
 * Configure current pi with given gains
 *
 * @param[in] f4_omega  The natural frequency in [Hz]
 * @param[in] f4_zeta   The damping factor
 **********************************************************************************************************************/
void aid_core_config_current_pi_gains(float f4_omega, float f4_zeta)
{
    float f4_omega_sqr;
    float f4_omega_rad;
    AID_ASSERT(f4_omega > 0.0f);
    AID_ASSERT((f4_zeta > 0.0f) && (f4_zeta <= 1.0f));

    f4_omega_rad = f4_omega * AID_TWOPI;
    f4_omega_sqr    = f4_omega_rad * f4_omega_rad;
    aid_f4_omega_current = f4_omega * AID_TWOPI;
    aid_f4_zeta_current = f4_zeta;

    aid_f4_kp_id    = (2.0f * f4_omega_rad * f4_zeta * aid_f4_ld) - aid_f4_r;
    st_aid_vd.f4_kp = aid_f4_kp_id;
    aid_f4_ki_id    = f4_omega_sqr * aid_f4_ld * aid_f4_ctrl_period_ms * 0.001f; 
    st_aid_vd.f4_ki = aid_f4_ki_id;
    aid_f4_kp_iq    = (2.0f * f4_omega_rad * f4_zeta * aid_f4_lq) - aid_f4_r;
    st_aid_vq.f4_kp = aid_f4_kp_iq;
    aid_f4_ki_iq    = f4_omega_sqr * aid_f4_lq * aid_f4_ctrl_period_ms * 0.001f;
    st_aid_vq.f4_ki = aid_f4_ki_iq;
    
    kp_id_final = 4096 * aid_f4_kp_id;
    ki_id_final = 16384 * aid_f4_ki_id;
    kp_iq_final = 4096 * aid_f4_kp_iq;
    ki_iq_final = 16384 * aid_f4_ki_iq;
    
  
    
} /* End of function aid_core_config_current_pi_gains */

/*******************************************************************************************************************//**
 * Configure speed pi with given gains
 *
 * @param[in] f4_omega  The natural frequency in [Hz]
 * @param[in] f4_zeta   The damping factor
 **********************************************************************************************************************/
void aid_core_config_bemf_obsv(float f4_omega, float f4_zeta)
{
    float f4_omega_sqr;
    float f4_omega_rad;

    AID_ASSERT(f4_omega > 0.0f);
    AID_ASSERT((f4_zeta > 0.0f) && (f4_zeta <= 1.0f));

    f4_omega_rad = f4_omega * AID_TWOPI;
    f4_omega_sqr = f4_omega_rad * f4_omega_rad;

    aid_f4_omega_e_obs = f4_omega_rad;
    aid_f4_zeta_e_obs = f4_zeta;

    /* Design of BEMF observer */
    f4_omega_sqr       = f4_omega_rad * f4_omega_rad;
    aid_f4_k_e_obs_d_1 = (2.0f * f4_omega_rad * f4_zeta) - (aid_f4_r / aid_f4_ld);
    aid_f4_k_e_obs_d_2 = f4_omega_sqr * aid_f4_ld;
    aid_f4_k_e_obs_q_1 = (2.0f * f4_omega_rad * f4_zeta) - (aid_f4_r / aid_f4_lq);
    aid_f4_k_e_obs_q_2 = f4_omega_sqr * aid_f4_lq;

} /* End of function aid_core_config_bemf_obsv */
float g_f4_vd_ref_mon;
float g_f4_id_ad_mon;
/*******************************************************************************************************************//**
 * @brief Carrier interrupt handler of CORE module
 * @details This function defines the process should be executed every PWM cycle
 * @pre AD conversion of current and DC bus voltage must be done before calling this function
 **********************************************************************************************************************/
void aid_core_crnt_ctrl_handler(void)
{
    float f4_temp0;
    uint32_t ret;
    float temp_f4_abc[3];
    float temp_f4_abc_2[3];
    float temp_f4_dq[2];

    if (AID_RUNMODE_INIT == aid_u2_run_mode)
    {
        core_restart_drive();
        aid_u2_run_mode = AID_RUNMODE_BOOT;
    }

//setpsw_i();                                                /* interrupt enable */

