tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/middleware autotune/r_aid_core.c
    /* Current measurement */
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
    aid_hal_get_current_abc(&aid_f4_ia_ad, &aid_f4_ib_ad, &aid_f4_ic_ad);
#else
    aid_hal_get_current_ab(&aid_f4_ia_ad, &aid_f4_ib_ad);
#endif

    /* Vdc measurement, calculate maximum magnitude of output voltage vector */
    aid_f4_vdc_ad = aid_hal_get_vdc();
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
    core_set_voltage_limit(aid_f4_duty_available * aid_f4_vdc_ad * 0.5f);
#else
    core_set_voltage_limit(aid_f4_duty_available * aid_f4_vdc_ad);
#endif


    if (AID_RUNMODE_BOOT == aid_u2_run_mode)
    {
        ret = core_offset_measure();
        if (1 == ret)
        {
            aid_u2_run_mode = AID_RUNMODE_READY;
        }
    }

    /* Current offset adjustment */
    aid_f4_ia_ad = aid_f4_ia_ad - aid_f4_offset_ia;
    aid_f4_ib_ad = aid_f4_ib_ad - aid_f4_offset_ib;
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
    aid_f4_ic_ad = aid_f4_ic_ad - aid_f4_offset_ic;
#endif
    /* Error check */
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
    core_check_over_current_error(aid_f4_ia_ad, aid_f4_ib_ad, aid_f4_ic_ad, aid_f4_overcurrent_limit);
#else
    core_check_over_current_error(aid_f4_ia_ad, aid_f4_ib_ad, 0.0f, aid_f4_overcurrent_limit);
#endif
    core_check_over_voltage_error(aid_f4_vdc_ad, aid_f4_overvoltage_limit);
    core_check_under_voltage_error(aid_f4_vdc_ad, aid_f4_undervoltage_limit);

    if (AID_RUNMODE_READY == aid_u2_run_mode && AID_ERROR_NONE == aid_u2_error_status)
    {

#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
        temp_f4_abc[0] = aid_f4_ia_ad;
        temp_f4_abc[1] = aid_f4_ib_ad;
        temp_f4_abc[2] = aid_f4_ic_ad;
        aid_transform_uvw_dq_abs(&aid_st_rotor_angle, temp_f4_abc , temp_f4_dq);
        aid_f4_id_ad = temp_f4_dq[0];
        aid_f4_iq_ad = temp_f4_dq[1];

#else
        /* Park transformation (ab -> dq) */
        aid_f4_id_ad = (aid_f4_temp_cos * aid_f4_ia_ad) + (aid_f4_temp_sin * aid_f4_ib_ad);
        aid_f4_iq_ad = ((-aid_f4_temp_sin) * aid_f4_ia_ad) + (aid_f4_temp_cos * aid_f4_ib_ad);
#endif
        /* BEMF Observer */
        if (aid_u2_ctrl_level >= AID_CTRL_LEVEL_2)
        {
            core_bemf_observer();
            core_estimator_filter(aid_f4_phase_error, aid_f4_e);
        }

        /* Angle and speed estimation/command generation (in open-loop operation)  */
        if (aid_u2_ctrl_level >= AID_CTRL_LEVEL_3)
        {
            core_angle_speed_est();
        }

#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
        aid_rotor_angle_update(&aid_st_rotor_angle, aid_f4_angle_rad);
#else
    aid_f4_temp_cos = cosf(aid_f4_angle_rad);
    aid_f4_temp_sin = sinf(aid_f4_angle_rad);
#endif

        /* Motor parameter identification sequences */
        gs_before_current_ctrl();   /* =>aid_motorid_sequence() */

        if (aid_u2_ctrl_level >= AID_CTRL_LEVEL_2)
        {
            /* Current PI */
            aid_f4_vd_ref = aid_pi_ctrl(&st_aid_vd, aid_f4_id_ref - aid_f4_id_ad);
            aid_f4_vq_ref = aid_pi_ctrl(&st_aid_vq, aid_f4_iq_ref - aid_f4_iq_ad);
        }

#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
        temp_f4_dq[0] = aid_f4_vd_ref;
        temp_f4_dq[1] = aid_f4_vq_ref;
        aid_transform_dq_uvw_abs(&aid_st_rotor_angle, temp_f4_dq, temp_f4_abc);
        aid_f4_va_ref = temp_f4_abc[0];
        aid_f4_vb_ref = temp_f4_abc[1];
        aid_f4_vc_ref = temp_f4_abc[2];
        g_f4_vd_ref_mon = aid_f4_vd_ref;
        g_f4_id_ad_mon = aid_f4_id_ad;
#else
        /*     Inverse park transformation (dq -> ab)      */
        aid_f4_va_ref = (aid_f4_temp_cos * aid_f4_vd_ref) - (aid_f4_temp_sin * aid_f4_vq_ref);
        aid_f4_vb_ref = (aid_f4_temp_sin * aid_f4_vd_ref) + (aid_f4_temp_cos * aid_f4_vq_ref);
#endif

        /*     voltage error compensation     */
        if (aid_u2_ctrl_level >= AID_CTRL_LEVEL_3)
        {
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
            temp_f4_dq[0] = aid_f4_id_ref;
            temp_f4_dq[1] = aid_f4_iq_ref;
            aid_transform_dq_uvw_abs(&aid_st_rotor_angle, temp_f4_dq, temp_f4_abc);
            aid_f4_ia_ref = temp_f4_abc[0];
            aid_f4_ib_ref = temp_f4_abc[1];
            aid_f4_ic_ref = temp_f4_abc[2];

            temp_f4_abc[0] = aid_f4_va_ref;
            temp_f4_abc[1] = aid_f4_vb_ref;
            temp_f4_abc[2] = aid_f4_vc_ref;
            temp_f4_abc_2[0] = aid_f4_ia_ref;
            temp_f4_abc_2[1] = aid_f4_ib_ref;
            temp_f4_abc_2[2] = aid_f4_ic_ref;
            aid_volterr_comp_main(&st_aid_volt_comp_p, temp_f4_abc, temp_f4_abc_2, aid_f4_vdc_ad);
            aid_f4_va_ref_comp = temp_f4_abc[0];
            aid_f4_vb_ref_comp = temp_f4_abc[1];
            aid_f4_vc_ref_comp = temp_f4_abc[2];
#else
            /* Calculate the ab current command to be used in voltage compensation as the inputs  */
            aid_f4_ia_ref = (aid_f4_temp_cos * aid_f4_id_ref) - (aid_f4_temp_sin * aid_f4_iq_ref);
            aid_f4_ib_ref = (aid_f4_temp_sin * aid_f4_id_ref) + (aid_f4_temp_cos * aid_f4_iq_ref);

            /* Only the first 2 phases require voltage compensation, ignore the 3rd phase */
            aid_f4_vcomp_array[0] = aid_f4_va_ref;
            aid_f4_vcomp_array[1] = aid_f4_vb_ref;
            aid_f4_vcomp_i_array[0] = aid_f4_ia_ref;
            aid_f4_vcomp_i_array[1] = aid_f4_ib_ref;
            aid_volterr_comp_main_ab(&st_aid_volt_comp_p, aid_f4_vcomp_array, aid_f4_vcomp_i_array, aid_f4_vdc_ad);

            aid_f4_va_ref_comp = aid_f4_vcomp_array[0];
            aid_f4_vb_ref_comp = aid_f4_vcomp_array[1];
#endif
        }
        else if (aid_u2_ctrl_level >= AID_CTRL_LEVEL_1)
        {
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
            temp_f4_abc[0] = aid_f4_va_ref;
            temp_f4_abc[1] = aid_f4_vb_ref;
            temp_f4_abc[2] = aid_f4_vc_ref;
            temp_f4_abc_2[0] = aid_f4_ia_ref;
            temp_f4_abc_2[1] = aid_f4_ib_ref;
            temp_f4_abc_2[2] = aid_f4_ic_ref;
            aid_volterr_comp_main(&st_aid_volt_comp_p, temp_f4_abc, temp_f4_abc_2, aid_f4_vdc_ad);
            aid_f4_va_ref_comp = temp_f4_abc[0];
            aid_f4_vb_ref_comp = temp_f4_abc[1];
            aid_f4_vc_ref_comp = temp_f4_abc[2];
#else
            /* Only the first 2 phases require voltage compensation, ignore the 3rd phase */
            aid_f4_vcomp_array[0] = aid_f4_va_ref;
            aid_f4_vcomp_array[1] = aid_f4_vb_ref;
            aid_f4_vcomp_i_array[0] = aid_f4_ia_ad;
            aid_f4_vcomp_i_array[1] = aid_f4_ib_ad;
            aid_volterr_comp_main_ab(&st_aid_volt_comp_p, aid_f4_vcomp_array, aid_f4_vcomp_i_array, aid_f4_vdc_ad);

