tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/middleware autotune/r_aid_core.c
            aid_f4_va_ref_comp = aid_f4_vcomp_array[0];
            aid_f4_vb_ref_comp = aid_f4_vcomp_array[1];
#endif
        }
        else
        {
            aid_f4_va_ref_comp = aid_f4_va_ref;
            aid_f4_vb_ref_comp = aid_f4_vb_ref;
            aid_f4_vc_ref_comp = aid_f4_vc_ref;
        }

        /*     limit (Voltage)     */
        aid_f4_va_ref_comp = R_AID_LimitfAbs(aid_f4_va_ref_comp, aid_f4_vphase_limit);
        aid_f4_vb_ref_comp = R_AID_LimitfAbs(aid_f4_vb_ref_comp, aid_f4_vphase_limit);
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
        aid_f4_vc_ref_comp = R_AID_LimitfAbs(aid_f4_vc_ref_comp, aid_f4_vphase_limit);
#endif

        /*     calculate modulation     */
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
        f4_temp0 = 1.0f / aid_f4_vdc_ad;
#else
        f4_temp0 = 0.5f / aid_f4_vdc_ad;                               /* modulation range (- vdc/2 -> vdc/2) to (- 1 -> 1 )  */
#endif

        aid_f4_moda = (aid_f4_va_ref_comp * f4_temp0) + 0.5f;
        aid_f4_modb = (aid_f4_vb_ref_comp * f4_temp0) + 0.5f;
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
        aid_f4_modc = (aid_f4_vc_ref_comp * f4_temp0) + 0.5f;
#endif

        /*     PWM reference setting    */
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
        aid_hal_pwm_set_duty_abc(aid_f4_moda, aid_f4_modb, aid_f4_modc);
#else
        aid_hal_pwm_set_duty_ab(aid_f4_moda, aid_f4_modb);
#endif
        {
            float f4_va_pwm_duty;
            float f4_vb_pwm_duty;
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
            float f4_vc_pwm_duty;
            aid_hal_pwm_get_duty_abc(&f4_va_pwm_duty, &f4_vb_pwm_duty, &f4_vc_pwm_duty);
#else
            aid_hal_pwm_get_duty_ab(&f4_va_pwm_duty, &f4_vb_pwm_duty);
#endif
            aid_f4_va_ref_pwm = (f4_va_pwm_duty - 0.5f) * 2.0f * aid_f4_vdc_ad;
            aid_f4_vb_ref_pwm = (f4_vb_pwm_duty - 0.5f) * 2.0f * aid_f4_vdc_ad;
#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
            aid_f4_vc_ref_pwm = (f4_vc_pwm_duty - 0.5f) * 2.0f * aid_f4_vdc_ad;
#endif
        }

        gs_after_pwm_output();   /* =>aid_motorid_sequence_post() */
    }
} /* End of function aid_core_crnt_ctrl_handler */

/*******************************************************************************************************************//**
 * Long period interrupt handler, for speed control and start-up sequence control
 **********************************************************************************************************************/
void aid_core_spd_ctrl_handler(void)
{
    float f4_temp0;

    aid_f4_1ms_speed_rad = aid_f4_speed_lpf_rad;                  /* speed */

    if (aid_u2_ctrl_level >= AID_CTRL_LEVEL_4)
    {
        /***** sensorless to openloop *****/
        f4_temp0 = fabsf(aid_f4_ref_speed_rad_ctrl);
        if (AID_ROTOR_ANGLE_MODE_CLOSEDLOOP == aid_s4_rotor_angle_mode)
        {
            if (f4_temp0 < aid_f4_id_up_speed_rad)
            {
                aid_u1_flag_down_to_ol = AID_FLG_SET;
            }
        }

        /***** Id, Iq, speed reference setting *****/
        aid_f4_ref_speed_rad_ctrl = core_generate_speed_ref();
        aid_f4_iq_ref = core_generate_iq_ref();
        aid_f4_id_ref = core_generate_id_ref();

        aid_u1_flag_down_to_ol = AID_FLG_CLR;

        if (AID_IQ_SPEED_PI_OUTPUT == aid_u1_flag_iq_ref)
        {
            aid_u2_ctrl_conf |= AID_CONTROL_SPEED;
        }
        else
        {
            aid_u2_ctrl_conf = AID_CONTROL_CURRENT;
        }
    }
} /* End of function aid_core_spd_ctrl_handler */

/*******************************************************************************************************************//**
 * @brief Stops driving motor, this also stops the PWM output
 **********************************************************************************************************************/
void aid_core_stop(void)
{
    /* Stop inverter */
    aid_hal_pwm_disable();                                /* PWM output disable */

    aid_f4_vd_ref = 0.0f;
    aid_f4_vq_ref = 0.0f;
    aid_f4_id_ref = 0.0f;
    aid_f4_iq_ref = 0.0f;
    aid_f4_speed_rad = 0.0f;
    aid_f4_ref_speed_rad = 0.0f;

    aid_u2_run_mode = AID_RUNMODE_INIT;
    aid_core_set_ctrl_level(AID_CTRL_LEVEL_0);
} /* End of function aid_core_stop */

/*******************************************************************************************************************//**
 * @brief     Core module initialization
 *
 * @param[in] pwm_tick_per_irq     The PWM tick per interrupt
 * @param[in] speed_ctrl_period    The speed control period
 * @param[in] before_current_ctrl  The handler of the event (function pointer) happens before current control
 * @param[in] after_pwm_output     The handler of the event (function pointer) happens after PWM output
 **********************************************************************************************************************/
void aid_core_init(uint8_t pwm_tick_per_irq,
                   float speed_ctrl_period,
                   core_delegate_t before_current_ctrl,
                   core_delegate_t after_pwm_output)
{
    float pwm_tick_cycle_ms;

    gs_before_current_ctrl = before_current_ctrl;
    gs_after_pwm_output = after_pwm_output;

    /* Check prerequisites */
    AID_ASSERT(pwm_tick_per_irq >= 1);

    /* Get inverter information from driver */
    aid_hal_get_inv_info(&aid_st_inv_info);

    /* Calculate cycles */
    AID_ASSERT(aid_st_inv_info.pwm_cycle_s > 0.0f);
    pwm_tick_cycle_ms = aid_st_inv_info.pwm_cycle_s * 1000.0f;
    aid_f4_pwm_period_ms = pwm_tick_cycle_ms;
    aid_f4_ctrl_period_ms = pwm_tick_cycle_ms * pwm_tick_per_irq;
    aid_f4_ctrl_freq_hz = 1.0f / aid_st_inv_info.pwm_cycle_s / pwm_tick_per_irq;

    AID_ASSERT((speed_ctrl_period * 1000.0f) > aid_f4_pwm_period_ms);
    aid_f4_spd_ctrl_period_ms = speed_ctrl_period * 1000.0f;
    aid_f4_spd_ctrl_freq_hz = 1.0f / speed_ctrl_period;

    /* Calculate voltage limiter coefficient, STM should be difference from BLDC,
     * actual maximum voltage magnitude will be calculated before offset calibration */
    AID_ASSERT(aid_st_inv_info.duty_min >= 0.0f);
    AID_ASSERT(aid_st_inv_info.duty_max > aid_st_inv_info.duty_min);
    if (aid_st_inv_info.duty_min > (1.0f - aid_st_inv_info.duty_max))
    {
        aid_f4_duty_available = 1.0f - (2.0f * aid_st_inv_info.duty_min);
    }
    else
    {
        aid_f4_duty_available = (aid_st_inv_info.duty_max * 2.0f) - 1.0f;
    }

