tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/middleware autotune/r_aid_core.c
    /* Set up protection thresholds */
    AID_ASSERT(aid_st_inv_info.overcurrent_th > 0.0f);
    aid_f4_overcurrent_limit_hw = aid_st_inv_info.overcurrent_th;
    aid_f4_overcurrent_limit = aid_f4_overcurrent_limit_hw;

    AID_ASSERT(aid_st_inv_info.overvoltage_th > 0.0f);
    aid_f4_overvoltage_limit = aid_st_inv_info.overvoltage_th;

    AID_ASSERT(aid_st_inv_info.undervoltage_th > 0.0f &&
            (aid_st_inv_info.undervoltage_th < aid_st_inv_info.overvoltage_th));
    aid_f4_undervoltage_limit = aid_st_inv_info.undervoltage_th;

    AID_ASSERT(aid_st_inv_info.current_lsb > 0.0f)
    aid_f4_current_lsb = aid_st_inv_info.current_lsb;

    AID_ASSERT(aid_st_inv_info.pwm_lsb > 0.0f)
    aid_f4_pwm_duty_lsb = aid_st_inv_info.pwm_lsb;

    aid_rotor_angle_init(&aid_st_rotor_angle);
    aid_volterr_comp_init(&st_aid_volt_comp_p, 0, 0, 1);
} /* End of function aid_core_init */

/*******************************************************************************************************************//**
 * @brief     Sets the control level of CORE module
 * @param[in] ctrl_level  The control level
 **********************************************************************************************************************/
void aid_core_set_ctrl_level(uint16_t ctrl_level)
{
    AID_ASSERT(ctrl_level <= AID_CTRL_LEVEL_4);
    aid_u2_ctrl_level = ctrl_level;
} /* End of function aid_core_set_ctrl_level */

/*******************************************************************************************************************//**
 * @brief   Resets CORE modules includes gain and motor parameters
 * @warning This function will resets all parameters in the module, and should be used only when new identification
 *          starts
 **********************************************************************************************************************/
void aid_core_reset(void)
{
    /* Common */
    aid_u4_sample_cnt = 0;
    aid_u2_1ms_cnt    = 0;
    aid_u2_sum_cnt    = 0;

    /* Reset modes */
    aid_s4_rotor_angle_mode = AID_ROTOR_ANGLE_MODE_OPENLOOP;
    aid_core_set_ctrl_level(AID_CTRL_LEVEL_0);
    aid_u2_error_status    = AID_ERROR_NONE;
    aid_u2_run_mode        = AID_RUNMODE_INIT;
    aid_u1_flag_id_ref     = AID_ID_UP;
    aid_u1_flag_iq_ref     = AID_IQ_ZERO_CONST;
    aid_u1_flag_speed_ref  = AID_SPEED_ZERO_CONST;
    aid_u1_flag_down_to_ol = 0;
    aid_u2_ctrl_conf = 0;

    /* Reset motor parameters */
    aid_f4_r_dc  = 0.0f;
    aid_f4_v_err = 0.0f;
    aid_f4_r     = 0.0f;
    aid_f4_ld    = 0.0f;
    aid_f4_lq    = 0.0f;
    aid_f4_ke    = 0.0f;
    aid_f4_j     = 0.0f;

    /* Motor driver */
    aid_f4_ia_ad  = 0.0f;
    aid_f4_ib_ad  = 0.0f;
    aid_f4_vd_ref = 0.0f;
    aid_f4_vq_ref = 0.0f;
    aid_f4_ia_ref = 0.0f;
    aid_f4_ib_ref = 0.0f;
    aid_f4_id_ref = 0.0f;
    aid_f4_iq_ref = 0.0f;
    aid_f4_id_ad  = 0.0f;
    aid_f4_iq_ad  = 0.0f;
    aid_f4_vdc_ad = 0.0f;

    aid_f4_imag_max = 1.0f;         /* This value will be overrided when setting rated current */


    /* Reset offset calibration */
    aid_f4_offset_ia = 0.0f;
    aid_f4_offset_ib = 0.0f;
    aid_f4_pre_offset_ia = 0.0f;
    aid_f4_pre_offset_ib = 0.0f;
    aid_f4_offset_lpf_k = g_f4_aid_offset_lpf_k;
    aid_f4_offset_calc_time = g_f4_aid_offset_calc_time;
    aid_u2_cnt_adjust = 0;

    /* Reset PLL */
    aid_f4_phase_error = 0.0f;
    aid_f4_speed_rad = 0.0f;
    aid_f4_angle_rad = 0.0f;
    aid_f4_kp_est_speed = 2 * AID_TWOPI * g_f4_aid_pll_est_omega * g_f4_aid_pll_est_zeta;
    aid_f4_ki_est_speed = (AID_TWOPI * g_f4_aid_pll_est_omega) * (AID_TWOPI * g_f4_aid_pll_est_omega) *
            (aid_f4_ctrl_period_ms * 0.001f);
    aid_f4_i_est_speed = 0.0f;
    aid_f4_temp_cos = 0.0f;
    aid_f4_temp_sin = 0.0f;

    /* Reset current control */
    aid_f4_omega_current = AID_TWOPI * g_f4_aid_current_omega;
    aid_f4_zeta_current = g_f4_aid_current_zeta;
    aid_f4_kp_id = 0.0f;
    aid_f4_ki_id = 0.0f;
    aid_f4_kp_iq = 0.0f;
    aid_f4_ki_iq = 0.0f;
    st_aid_vd.f4_kp = 0.0f;
    st_aid_vd.f4_ki = 0.0f;
    st_aid_vd.f4_refi = 0.0f;
    st_aid_vd.f4_ilimit = aid_f4_overvoltage_limit;
    st_aid_vq.f4_kp = 0.0f;
    st_aid_vq.f4_ki = 0.0f;
    st_aid_vq.f4_refi = 0.0f;
    st_aid_vq.f4_ilimit = aid_f4_overvoltage_limit;

    /* Reset BEMF observer */
    aid_f4_omega_e_obs = AID_TWOPI * g_f4_aid_e_obs_omega;
    aid_f4_zeta_e_obs = g_f4_aid_e_obs_zeta;
    aid_f4_k_e_obs_d_1 = 0.0f;
    aid_f4_k_e_obs_d_2 = 0.0f;
    aid_f4_k_e_obs_q_1 = 0.0f;
    aid_f4_k_e_obs_q_2 = 0.0f;
    aid_f4_pre_id_ad = 0.0f;
    aid_f4_pre_id_est = 0.0f;
    aid_f4_pre_dd = 0.0f;
    aid_f4_id_est = 0.0f;
    aid_f4_dd = 0.0f;
    aid_f4_pre_iq_ad = 0.0f;
    aid_f4_pre_iq_est = 0.0f;
    aid_f4_pre_dq = 0.0f;
    aid_f4_iq_est = 0.0f;
    aid_f4_dq = 0.0f;
    aid_f4_ed = 0.0f;
    aid_f4_eq = 0.0f;
    aid_f4_e = 0.0f;
    aid_f4_e_lpf = 0.0f;

    /* Reset speed control, speed change rate limiter */
    aid_f4_kp_speed = 0.0f;
    aid_f4_ki_speed = 0.0f;
    aid_f4_lim_iq = 0.0f;
    aid_f4_ref_speed_rad_ctrl = 0.0f;
    aid_f4_ref_speed_rad = 0.0f;
    aid_f4_limit_speed_change = g_f4_aid_speed_change_rate_limit;
    st_aid_speed.f4_kp = 0.0f;
    st_aid_speed.f4_ki = 0.0f;
    st_aid_speed.f4_refi = 0.0f;
    st_aid_speed.f4_ilimit = 0.0f;

    /* Reset start-up sequence parameters */
    aid_f4_id_down_speed_rad = 0.0f;
    aid_f4_id_up_speed_rad = 0.0f;
    aid_f4_id_up_step = 0.0f;
    aid_f4_id_down_step = 0.0f;
    aid_f4_ref_id = 0.0f;
    aid_f4_iq_down_step = 0.0f;
    aid_f4_ol_iq_down_step = 1.0f / g_f4_aid_iq_down_time;

    /* Resets modulation */
    aid_f4_va_ref = 0.0f;
    aid_f4_vb_ref = 0.0f;
    aid_f4_va_ref_comp = 0.0f;
    aid_f4_vb_ref_comp = 0.0f;
    aid_f4_vphase_limit = 0.0f;
    aid_f4_moda = 0.0f;
    aid_f4_modb = 0.0f;

    /* Reset voltage error compensation */
    aid_f4_vcomp_array[0] = 0.0f;
    aid_f4_vcomp_array[1] = 0.0f;
    aid_f4_vcomp_i_array[0] = 0.0f;
    aid_f4_vcomp_i_array[1] = 0.0f;
    st_aid_volt_comp_p.u1_volt_err_comp_enable = AID_FLG_SET;

