tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/middleware autotune/r_aid_core.c
    /* Reset speed LPF */
    aid_f4_speed_lpf_rad = 0.0f;
    aid_f4_1ms_speed_rad = 0.0f;
    aid_f4_speed_lpf_omega_hz = 125.0f;
    R_AID_FirstOrderLpffInit(&aid_st_speed_lpf);
    R_AID_FirstOrderLpffGainCalc(&aid_st_speed_lpf, aid_f4_speed_lpf_omega_hz, aid_f4_ctrl_period_ms * 0.001f);

    /* Reset flags */
    aid_st_warn.u4_warn_core_flags = 0;

#if (AID_MOTOR_TYPE == AID_MOTOR_TYPE_BLDC)
    aid_f4_ic_ad = 0.0f;
    aid_f4_vc_ref = 0.0f;
    aid_f4_va_ref_comp = 0.0f;
    aid_f4_modc = 0.0f;
    aid_rotor_angle_reset(&aid_st_rotor_angle);
#endif
} /* End of function aid_core_reset */

/*******************************************************************************************************************//**
 * @brief   Resets start-up sequence and related variables
 **********************************************************************************************************************/
void aid_core_reset_startup_seq(void)
{
    aid_f4_id_ref               = 0.0f;
    aid_f4_iq_ref               = 0.0f;
    aid_f4_ref_speed_rad_ctrl   = 0.0f;
    aid_u1_flag_speed_ref       = AID_SPEED_ZERO_CONST;
    aid_u1_flag_id_ref          = AID_ID_UP;
    aid_u1_flag_iq_ref          = AID_IQ_ZERO_CONST;
    aid_f4_torque_current       = 0.0f;
} /* End of function aid_core_reset_startup_seq */

/***********************************************************************************************************************
 * Function Name: aid_core_warning
 * Description  : Send warning message without stopping identification
 * Arguments    : u4_warn_code -
 *                    Which warning has happened
 *                f4_related_val -
 *                    The value related to the warning to send
 * Return Value : None
 **********************************************************************************************************************/
void aid_core_warning(uint32_t u4_warn_code)
{
    switch(u4_warn_code)
    {
        case AID_WARN_NONE:
        {
            __asm __volatile("nop\n");
        }
        break;

        /* These warning code conditions are intentionally combined */
        case AID_WARN_VOLT_LIMIT:
        case AID_WARN_CURNT_LIMIT:
        {
            aid_st_warn.u4_warn_core_flags |= u4_warn_code;
        }
        break;

        /* Not a predefined warning in core, TODO: require father implementation */
        default:
        {
            /* Do nothing */
            __asm __volatile("nop\n");
        }
    }
} /* End of function aid_core_warning */

/** @} */
/* End of file r_aid_core.c */
